// (Време + 15 минути) : Да се напише програма, която въвежда час и минути от 24-часово денонощие и изчислява колко ще е часът след 15 минути.
// Резултатът да се отпечата във формат hh:mm. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. 
// Часовете и минутите се изписват винаги с по две цифри, с водеща нула когато е необходимо

#include <iostream>

int main()
{

	int hours = 0;
	int minutes = 0;
	std::cin >> hours >> minutes;

	(minutes += 15) %= 60;

	if (minutes < 15)
	{

		(hours += 1) %= 24;

	}

	if (hours <= 9) 
	{

		std::cout << 0;
		std::cout << hours << ":";

	}

	if (minutes <= 9) 
	{

		std::cout << 0;
		std::cout << minutes << std::endl;

	}
		
	return 0;

}
