// Ще казваме, че поредица от числа е трион, ако всяко число в нея е едновременно поголямо или равно от двата си съседа или пък едновременно по-малко или равно от тях.
// За първия и последния елемент имаме само по един съсед. Напишете програма, която въвежда от стандартния 5 на брой цели числа.
// Да се изведе на стандартния изход "yes", ако въведената поредица е трион, или "no", в противен случай.

#include <iostream>

int main()
{

	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;

	std::cin >> a >> b >> c >> d >> e;

	if ((a <= b && b >= c && c <= d && d >= e)
		|| (a >= b && b <= c && c >= d && d <= e))
	{

		std::cout << "Yes";

	}
	else
	{

		std::cout << "No";

	}

	return 0;

}
